Dynamo.Graph.Nodes.PortModel.IsDominantInput
A flag indicating whether the Port is the dominant input.

Dynamo.Graph.Nodes.PortModel.InputDataLevel
An integer representing the level of nesting to access
within data coming into this port.