Dynamo.Graph.Nodes.NodeModel.CreateLevelSelectionNodes(System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode},System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode}@)
Create AST which extracts data from nested collection at the level specified by a port's InputDataLevel parameter.
inputAstNodes:
A collection of AssociativeNode objects which represent the inputs to the data level extraction process.
levelExtractionIdentifiers:
A collection of Identifier nodes containing the unique identifiers for our data extraction calls.
Returns: A list of AssociativeNode objects corresponding in number to the number of inputs.

Dynamo.Graph.Nodes.NodeModel.PromoteToDominantArray(System.Int32,System.Int32,ProtoCore.AST.AssociativeAST.AssociativeNode)
Create AST which superimposes a collection of data onto another collection at the specified level.
outputIndex:
The index of the output node to whose identifier the result of the function call will be assigned.
dominantLevel:
The InputDataLevel of the 'dominant' port.
dominantDataNode:
An AssociativeNode representing the dominant array.
Returns: An AssociativeNode representing the assignment of superimposition operation.

Dynamo.Graph.Nodes.NodeModel.SetReplicationGuides
Set the replication guides for the node's ports based on the LacingStrategy for the node.
This is used to provide backward support for node's which do not have saved values
for their replication guides.

Dynamo.Graph.Nodes.NodeModel.SupportsPortLevelDataExtraction
A flag indicating whether this node supports extraction
of data at a level on input ports.