Dynamo.Models.NodeModelAssemblyLoader.LoadNodeModelsAndMigrations(System.Collections.Generic.IEnumerable{System.String},System.String,System.Collections.Generic.List{Dynamo.Models.TypeLoadData}@,System.Collections.Generic.List{Dynamo.Models.TypeLoadData}@)
Load all types which inherit from NodeModel whose assemblies are located in
the bin/nodes directory. Add the types to the searchviewmodel and
the controller's dictionaries.
nodeDirectories: Directories that contain node assemblies.
context:
modelTypes:
migrationTypes:

Dynamo.Models.NodeModelAssemblyLoader.LoadNodesFromAssembly(System.Reflection.Assembly,System.String,System.Collections.Generic.List{Dynamo.Models.TypeLoadData},System.Collections.Generic.List{Dynamo.Models.TypeLoadData})
Enumerate the types in an assembly and add them to DynamoController's
dictionaries and the search view model.  Internally catches exceptions and sends the error
to the console.
The list of node types loaded from this assembly