Dynamo.Models.DynamoModel.OnAsyncTaskStateChanged(Dynamo.Core.Threading.DynamoScheduler,Dynamo.Core.Threading.TaskStateChangedEventArgs)
This event handler is invoked when DynamoScheduler changes the state
of an AsyncTask object. See TaskStateChangedEventArgs.State for more
details of these state changes.
sender: The scheduler which raised the event.
e: Task state changed event argument.

Dynamo.Models.DynamoModel.AddCustomNodeWorkspace(Dynamo.Models.CustomNodeWorkspaceModel)
Add a new, visible Custom Node workspace to Dynamo
workspace:

Dynamo.Models.DynamoModel.RemoveWorkspace(Dynamo.Models.WorkspaceModel)
Remove a workspace from the dynamo model.
workspace:

Dynamo.Models.DynamoModel.AddNodeToCurrentWorkspace(Dynamo.Models.NodeModel,System.Boolean)
Adds a node to the current workspace.
node:
centered:

Dynamo.Models.DynamoModel.Paste(Dynamo.Utilities.Point2D)
Paste ISelectable objects from the clipboard to the workspace at specified point.
targetPoint: Location where data will be pasted

Dynamo.Models.DynamoModel.AddWorkspace(Dynamo.Models.WorkspaceModel)
Adds a workspace to the dynamo model.
workspace: