Dynamo.Models.WorkspaceModel.currentPasteOffset
The offset of the elements in the current paste operation

Dynamo.Models.WorkspaceModel.PasteOffsetStep
The step to offset elements between subsequent paste operations

Dynamo.Models.WorkspaceModel.PasteOffsetMax
The maximum paste offset before reset

Dynamo.Models.WorkspaceModel.RequestNodeCentered
Event that is fired when a workspace requests that a Node or Note model is
centered.

Dynamo.Models.WorkspaceModel.OnRequestNodeCentered(System.Object,Dynamo.Models.ModelEventArgs)
Requests that a Node or Note model should be centered.
sender:
e:

Dynamo.Models.WorkspaceModel.ZoomChanged
Event that is fired every time the zoom factor of a workspace changes.

Dynamo.Models.WorkspaceModel.OnZoomChanged(System.Object,Dynamo.Models.ZoomEventArgs)
Used during open and workspace changes to set the zoom of the workspace
sender:
e:

Dynamo.Models.WorkspaceModel.CurrentOffsetChanged
Event that is fired every time the position offset of a workspace changes.

Dynamo.Models.WorkspaceModel.OnCurrentOffsetChanged(System.Object,Dynamo.Models.PointEventArgs)
Used during open and workspace changes to set the location of the workspace
sender:
e:

Dynamo.Models.WorkspaceModel.WorkspaceSaved
Event that is fired when the workspace is saved.

Dynamo.Models.WorkspaceModel.NodeAdded
Event that is fired when a node is added to the workspace.

Dynamo.Models.WorkspaceModel.NodeRemoved
Event that is fired when a node is removed from the workspace.

Dynamo.Models.WorkspaceModel.NodesCleared
Event that is fired when nodes are cleared from the workspace.

Dynamo.Models.WorkspaceModel.NoteAdded
Event that is fired when a note is added to the workspace.

Dynamo.Models.WorkspaceModel.NoteRemoved
Event that is fired when a note is removed from the workspace.

Dynamo.Models.WorkspaceModel.NotesCleared
Event that is fired when notes are cleared from the workspace.

Dynamo.Models.WorkspaceModel.AnnotationAdded
Event that is fired when an annotation is added to the workspace.

Dynamo.Models.WorkspaceModel.AnnotationRemoved
Event that is fired when an annotation is removed from the workspace.

Dynamo.Models.WorkspaceModel.AnnotationsCleared
Event that is fired when annotations are cleared from the workspace.

Dynamo.Models.WorkspaceModel.ConnectorAdded
Event that is fired when a connector is added to the workspace.

Dynamo.Models.WorkspaceModel.ConnectorDeleted
Event that is fired when a connector is deleted from a workspace.

Dynamo.Models.WorkspaceModel.Disposed
Event that is fired when this workspace is disposed of.

Dynamo.Models.WorkspaceModel.Saving
Event that is fired during the saving of the workspace.
Add additional XmlNode objects to the XmlDocument provided,
in order to save data to the file.

Dynamo.Models.WorkspaceModel.NodeFactory
A NodeFactory used by this workspace to create Nodes.

Dynamo.Models.WorkspaceModel.Presets
A set of input parameter states, this can be used to set the graph to a serialized state.

Dynamo.Models.WorkspaceModel.LastSaved
The date of the last save.

Dynamo.Models.WorkspaceModel.Author
An author of the workspace

Dynamo.Models.WorkspaceModel.Description
A description of the workspace

Dynamo.Models.WorkspaceModel.HasUnsavedChanges
Are there unsaved changes in the workspace?

Dynamo.Models.WorkspaceModel.Nodes
All of the nodes currently in the workspace.

Dynamo.Models.WorkspaceModel.Connectors
All of the connectors currently in the workspace.

Dynamo.Models.WorkspaceModel.Notes
All of the notes currently in the workspace.

Dynamo.Models.WorkspaceModel.FileName
Path to the file this workspace is associated with. If null or empty, this workspace has never been saved.

Dynamo.Models.WorkspaceModel.Name
The name of this workspace.

Dynamo.Models.WorkspaceModel.X
Get or set the X position of the workspace.

Dynamo.Models.WorkspaceModel.Y
Get or set the Y position of the workspace

Dynamo.Models.WorkspaceModel.Height
Get the height of the workspace's bounds.

Dynamo.Models.WorkspaceModel.Width
Get the width of the workspace's bounds.

Dynamo.Models.WorkspaceModel.Rect
Get the bounds of the workspace.

Dynamo.Models.WorkspaceModel.CanUndo
Determine if undo operation is currently possible.

Dynamo.Models.WorkspaceModel.CanRedo
Determine if redo operation is currently possible.

Dynamo.Models.WorkspaceModel.UndoRecorder
Get the current UndoRedoRecorder that is associated with the current
WorkspaceModel. Note that external parties should not have the needs
to access the recorder directly, so this property is exposed just as
a "temporary solution". Before using this property, consider using
WorkspaceModel.RecordModelsForUndo method which allows for multiple
modifications in a single action group.

Dynamo.Models.WorkspaceModel.Guid
A unique identifier for the workspace.

Dynamo.Models.WorkspaceModel.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
2

Dynamo.Models.WorkspaceModel.Clear
Clears this workspace of nodes, notes, and connectors.

Dynamo.Models.WorkspaceModel.SaveAs(System.String,ProtoCore.RuntimeCore,System.Boolean)
Save to a specific file path, if the path is null or empty, does nothing.
If successful, the CurrentWorkspace.FilePath field is updated as a side effect
newPath: The path to save to
core:
isBackup: Indicates whether saved workspace is backup or not. If it's not backup,
we should add it to recent files. Otherwise leave it.

Dynamo.Models.WorkspaceModel.AddAndRegisterNode(Dynamo.Models.NodeModel,System.Boolean)
Adds a node to this workspace.

Dynamo.Models.WorkspaceModel.NodeModified(Dynamo.Models.NodeModel)
Indicates that the AST for a node in this workspace requires recompilation

Dynamo.Models.WorkspaceModel.RemoveNode(Dynamo.Models.NodeModel)
Removes a node from this workspace.
This method does not raise a NodesModified event. (LC notes this is clearly not true)
model:

Dynamo.Models.WorkspaceModel.DoGraphAutoLayout
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.

Dynamo.Models.WorkspaceModel.GenerateCombinedGraph(System.Boolean)
This method extracts all models from the workspace and puts them
into the combined graph object, LayoutSubgraphs.First()
isGroupLayout: True if all the selected models are groups.

Dynamo.Models.WorkspaceModel.RecordUndoGraphLayout(System.Boolean)
This method adds relevant models to the undo recorder.
isGroupLayout: True if all the selected models are groups.

Dynamo.Models.WorkspaceModel.GenerateSeparateSubgraphs
This method repeatedly takes a selected node in the combined graph and
uses breadth-first search to find all other nodes in the same subgraph
until all selected nodes have been processed.

Dynamo.Models.WorkspaceModel.RunLayoutSubgraph(GraphLayout.Graph,System.Boolean)
This function calls the graph layout algorithm methods.
graph: The subgraph to be processed.
isGroupLayout: True if all selected models are groups.

Dynamo.Models.WorkspaceModel.AvoidSubgraphOverlap
This method repeatedly shifts subgraphs away vertically from each other
when there are any two nodes from different subgraphs overlapping.

Dynamo.Models.WorkspaceModel.SaveLayoutGraph
This method pushes changes from the GraphLayout.Graph objects
back to the workspace models.

Dynamo.Models.WorkspaceModel.annotationModel_GetModelBase(System.Guid)
Get the model from Workspace
modelGuid: The model unique identifier.
Returns:

Dynamo.Models.WorkspaceModel.CheckIfModelExistsInSameGroup(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Models.NoteModel})
Checks if model exists in same group.
selectNodes: The select nodes.
selectNotes: The select notes.
Returns: true if the models are already in the same group

Dynamo.Models.WorkspaceModel.Save(ProtoCore.RuntimeCore)
Save assuming that the Filepath attribute is set.

Dynamo.Models.WorkspaceModel.ResetWorkspaceCore
Derived workspace classes can choose to override
this method to perform clean-up specific to them.

Dynamo.Models.WorkspaceModel.IncrementPasteOffset
Increment the current paste offset to prevent overlapping pasted elements

Dynamo.Models.WorkspaceModel.AddPresetCore(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
this method creates a new preset state from a set of NodeModels and adds this new state to this presets collection
name: the name of preset state
description: a description of what the state does
currentSelection: a set of NodeModels that are to be serialized in this state
id: a GUID id for the state, if not supplied, a new GUID will be generated, cannot be a duplicate

Dynamo.Models.WorkspaceModel.RecordModelsForModification(System.Collections.Generic.List{Dynamo.Models.ModelBase},Dynamo.Core.UndoRedoRecorder)
TODO(Ben): This method is exposed this way for external codes (e.g.
the DragCanvas) to record models before they are modified. This is
by no means ideal. The ideal case of course is for ALL codes that
end up modifying models to be folded back into WorkspaceViewModel in
the form of commands. These commands then internally record those
affected models before updating them. We need this method to be gone
sooner than later.
models: The models to be recorded for undo.
recorder:

Dynamo.Models.WorkspaceModel.IsInternalNodeToCodeConnection(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},Dynamo.Models.ConnectorModel)
Checks whether the given connection is inside the node to code set or outside it.
This determines if it should be redrawn(if it is external) or if it should be
deleted (if it is internal)

Dynamo.Models.WorkspaceModel.ReConnectOutputConnections(System.Collections.Generic.Dictionary{Dynamo.Models.ConnectorModel,System.String},Dynamo.Nodes.CodeBlockNodeModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalOutputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node

Dynamo.Models.WorkspaceModel.ReConnectInputConnections(System.Collections.Generic.Dictionary{Dynamo.Models.ConnectorModel,System.String},Dynamo.Nodes.CodeBlockNodeModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalInputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node