Dynamo.Interfaces.IRenderPackageFactory
IRenderPackageFactory is used to create IRenderPackage objects suitable
for a specific rednering pipeline. IRenderPackages generated from IRenderPackageFactory
classes contain tessellated geometry for rendering, which may be stored
in different forms depending on the rendering pipeline being used.

Dynamo.Interfaces.IRenderPackageFactory.CreateRenderPackage
Create an IRenderPackage object of the type manufactured by this factory.