Dynamo.Migration.MigrationManager.AddMigrationType(Dynamo.Models.TypeLoadData)
Adds a new type containing Migration methods into this manager.
t:

Dynamo.Migration.MigrationManager.ProcessWorkspace(Dynamo.Models.WorkspaceInfo,System.Xml.XmlDocument,System.Boolean,Dynamo.Models.NodeFactory)
Attempts to migrate a workspace to the current version of Dynamo.
workspaceInfo:
xmlDoc:
Returns:

Dynamo.Migration.MigrationManager.VersionFromWorkspace(Dynamo.Models.WorkspaceModel)
Call this method to obtain the version of current WorkspaceModel.
Note that the revision number is dropped as both "0.7.0.1234"
should be treated as the same version as "0.7.0.5678", and no file
migration should take place.
workspace: The WorkspaceModel to get the Version from.
Returns: Returns the Version object representing the workspace
version with the revision set to 0.

Dynamo.Migration.MigrationManager.CreateFunctionNodeFrom(System.Xml.XmlElement,System.String[])
Call this method to create a XmlElement with a set of attributes
carried over from the source XmlElement. The new XmlElement will
have a name of "Dynamo.Nodes.DSFunction".
srcElement: The source XmlElement object.
attribNames: The list of attribute names whose values
are to be carried over to the resulting XmlElement. This list is
mandatory and it cannot be empty. If a specified attribute cannot
be found in srcElement, an empty attribute with the same name will
be created in the resulting XmlElement.
Returns: Returns the resulting XmlElement with specified attributes
duplicated from srcElement. The resulting XmlElement will also have
a mandatory "type" attribute with value "Dynamo.Nodes.DSFunction".

Dynamo.Migration.MigrationManager.CreateFunctionNodeFrom(System.Xml.XmlElement)
Call this method to create a duplicated XmlElement with
all the attributes found from the source XmlElement.
srcElement: The source XmlElement to duplicate.
Returns: Returns the duplicated XmlElement with all attributes
found in the source XmlElement. The resulting XmlElement will also
have a mandatory "type" attribute with value "Dynamo.Nodes.DSFunction".