Dynamo.Core.UndoRedoRecorder.RecordCreationForUndo(Dynamo.Models.ModelBase)
Record the given model right after it has been created. This results
in a creation action to be recorded under the current action group.
Undoing this action will result in the model being deleted.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.RecordDeletionForUndo(Dynamo.Models.ModelBase)
Record the given model right before it has been deleted. This
results in a deletion action to be recorded under the current action
group. Undoing this action will result in the model being created
and re-inserted into the current workspace.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.RecordModificationForUndo(Dynamo.Models.ModelBase)
Record the given model right before it is modified. This results
in a modification action to be recorded under the current action
group. Undoing this action will result in the model being reverted
to the states that it was in before the modification took place.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.IsRecordedInActionGroup(System.Xml.XmlElement,Dynamo.Models.ModelBase)
The recorder calls this method to determine if a given model has
already been recorded in the active action group. For an example,
if there is a connection between NodeA and NodeB, selecting both
the nodes and deleting them will cause the connection model to be
recorded twice (when a node is deleted, its connections are being
recorded for undo).
group: The action group to check against.
model: The model to check against.
Returns: Returns true if the model has already been recorded in the
current action group, or false otherwise.