Dynamo.Logging.LogMessage.Warning(System.String,Dynamo.WarningLevel)
Creates a LogMessage representing a warning.
message:
severity:
Returns:

Dynamo.Logging.LogMessage.Log(Dynamo.Interfaces.ILogger,Dynamo.Interfaces.ILogMessage)
Logs a LogMessage.
logger:
message: