Dynamo.Nodes.FunctionCallNodeController`1
Controller for nodes that act as function calls.

Dynamo.Nodes.FunctionCallNodeController`1.Definition
A FunctionDescriptor describing the function that this controller will call.

Dynamo.Nodes.FunctionCallNodeController`1.NickName
NickName for nodes using this controller, based on the underlying FunctionDescriptor.

Dynamo.Nodes.FunctionCallNodeController`1.ReturnKeys
ReturnKeys for multi-output functions.

Dynamo.Nodes.FunctionCallNodeController`1.BuildAst(Dynamo.Models.NodeModel,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Produces AST for a function call. Takes into account multi-outputs and partial application.
model: NodeModel to produce an AST for.
inputAstNodes: Arguments to the function call.

Dynamo.Nodes.FunctionCallNodeController`1.BuildAstForPartialMultiOutput(Dynamo.Models.NodeModel,ProtoCore.AST.AssociativeAST.AssociativeNode,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Produces AST for a partial function application of a multi-output function.
model: NodeModel to produce AST for.
rhs: AST representing the partial application. This will need to be used to assign all output port identifiers.
resultAst: Result accumulator: add all new output AST to this list.

Dynamo.Nodes.FunctionCallNodeController`1.AssignIdentifiersForFunctionCall(Dynamo.Models.NodeModel,ProtoCore.AST.AssociativeAST.AssociativeNode,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Produces AST that assigns all necessary Identifiers for the given NodeModel from
the produced function call AST.
model: Model to produce AST for.
rhs: AST for the function call. This will need to be used to assign all output port identifiers.
resultAst: Result accumulator: add all new output AST to this list.

Dynamo.Nodes.FunctionCallNodeController`1.BuildOutputAst(Dynamo.Models.NodeModel,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode},System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Produces AST for the given NodeModel that will call the underlying
Function and assign all Identifiers for the node.
model: NodeModel to produce AST for.
inputAstNodes: Arguments to the function call.
resultAst: Result accumulator: add all new output AST to this list.

Dynamo.Nodes.FunctionCallNodeController`1.InitializeInputs(Dynamo.Models.NodeModel)
Initialize all input ports on the given node based on the underlying
function.
model: Node to initialize.

Dynamo.Nodes.FunctionCallNodeController`1.InitializeOutputs(Dynamo.Models.NodeModel)
Initialize all output ports on the given node based on the underlying
function.
model: Node to initialize.

Dynamo.Nodes.FunctionCallNodeController`1.GetFunctionApplication(Dynamo.Models.NodeModel,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Produces AST representing a function application for the given NodeModel, using the
given arguments. This should not assign any of the node's identifiers.
model: Node to produce a function application for.
inputAstNodes: Arguments to the function application.

Dynamo.Nodes.FunctionCallNodeController`1.DeserializeCore(System.Xml.XmlElement,Dynamo.Models.SaveContext)
Deserializes Controller information from XML.

Dynamo.Nodes.FunctionCallNodeController`1.SerializeCore(System.Xml.XmlElement,Dynamo.Models.SaveContext)
Serializes Controller information from XML.

Dynamo.Nodes.FunctionCallNodeController`1.SyncNodeWithDefinition(Dynamo.Models.NodeModel)
Synchronizes a node with this controller, based on the underlying function.
model: Node to sync.

Dynamo.Nodes.FunctionCallNodeController`1.SyncWithDefinitionStart
Event handler for the event when node starts syncing with its
definition.

Dynamo.Nodes.FunctionCallNodeController`1.OnSyncWithDefinitionStart(Dynamo.Models.NodeModel)
Start syncing with its definition.
obj:

Dynamo.Nodes.FunctionCallNodeController`1.SyncWithDefinitionEnd
Event handler for the event when node finishes syncing with its
definition.

Dynamo.Nodes.FunctionCallNodeController`1.OnSyncWithDefintionEnd(Dynamo.Models.NodeModel)
Finish syncing with its definition.
obj: