Dynamo.Models.CustomNodeWorkspaceModel.CustomNodeDependencies
All CustomNodeDefinitions which this Custom Node depends on.

Dynamo.Models.CustomNodeWorkspaceModel.CustomNodeDefinition
The definition of this custom node, based on the current state of this workspace.

Dynamo.Models.CustomNodeWorkspaceModel.CustomNodeInfo
The information about this custom node, based on the current state of this workspace.

Dynamo.Models.CustomNodeWorkspaceModel.Category
Search category for this workspace, if it is a Custom Node.

Dynamo.Models.CustomNodeWorkspaceModel.Description
A description of the workspace

Dynamo.Models.CustomNodeWorkspaceModel.IsVisibleInDynamoLibrary
Custom node visibility in the Dynamo library