Dynamo.Models.PresetModel
This class references a set of nodemodels, and a set of serialized versions of those nodemodels
a client can use this class to store the state of a set of nodes from a graph

Dynamo.Models.PresetModel.Nodes
list of nodemodels that this state serializes

Dynamo.Models.PresetModel.SerializedNodes
list of serialized nodes

Dynamo.Models.PresetModel.#ctor(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
create a new presetsState, this will serialize all the referenced nodes by calling their serialize method,
the resulting XML elements will be used to save this state when the presetModel is saved on workspace save
name: name for the state, must not be null
description: description of the state, can be null
inputsToSave: set of nodeModels, must not be null
id: an id GUID, can be empty GUID

Dynamo.Models.PresetModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
this overload is used for loading with deserializeCore, we must pass the nodesInTheGraph to the instance of the Preset so that
we can detect missing nodes
nodesInGraph: