Dynamo.Core.NodeGraph.LoadNodeFromXml(System.Xml.XmlElement,Dynamo.Models.SaveContext,Dynamo.Models.NodeFactory,ProtoCore.Namespace.ElementResolver)
Creates and initializes a NodeModel from its Xml representation.
elNode: XmlElement for a NodeModel.
context: The serialization context for initialization.
nodeFactory: A NodeFactory, to be used to create the node.
Returns:

Dynamo.Core.NodeGraph.LoadConnectorFromXml(System.Xml.XmlElement,System.Collections.Generic.IDictionary{System.Guid,Dynamo.Models.NodeModel})
Creates and initializes a ConnectorModel from its Xml representation.
connEl: XmlElement for a ConnectorModel.
nodes: Dictionary to be used for looking up a NodeModel by it's Guid.
Returns: Returns the new instance of ConnectorModel loaded from XmlElement.

Dynamo.Core.NodeGraph.LoadNoteFromXml(System.Xml.XmlNode)
Creates and initializes a NoteModel from its Xml representation.
note:
Returns:

Dynamo.Core.NodeGraph.LoadGraphFromXml(System.Xml.XmlDocument,Dynamo.Models.NodeFactory)
Loads NodeModels, ConnectorModels, and NoteModels from an XmlDocument.
xmlDoc: An XmlDocument representing a serialized Dynamo workspace.
nodeFactory: A NodeFactory, used to load and instantiate nodes.
elementResolver:
Returns: