Dynamo.Models.ModelBase.Disposed
Fired when this Model is disposed.

Dynamo.Models.ModelBase.X
The X coordinate of the node in canvas space.

Dynamo.Models.ModelBase.Y
The Y coordinate of the node in canvas space.

Dynamo.Models.ModelBase.Position
A position defined by the x and y components.
Used for notification in situations where you don't
want to have property notifications for X and Y

Dynamo.Models.ModelBase.Height
The height of the node.

Dynamo.Models.ModelBase.Width
The width of the node.

Dynamo.Models.ModelBase.SetSize(System.Double,System.Double)
Set the width and the height of the node model
and report once.
w:
h:

Dynamo.Models.ModelBase.HandleModelEvent(System.String,Dynamo.Core.UndoRedoRecorder)
This method is currently used as a way to send an event to ModelBase
derived objects. Its primary use is in DynamoNodeButton class, which
sends this event when clicked.
eventName: The name of the event.
recorder:
Returns: Returns true if the call has been handled, or false otherwise.

Dynamo.Models.ModelBase.UpdateValueCore(Dynamo.Models.UpdateValueParams)
This method is supplied as a generic way for command framework to update
a given named-value in a ModelBase (which has to work under both user
and playback scenarios). During playback, the command framework issues
pre-recorded UpdateModelValueCommand that targets a model. Since there
is no data-binding at play here, there will not be IValueConverter. This
method takes only string input (the way they appear in DynamoTextBox),
which overridden method can use for value conversion.
updateValueParams: Please see UpdateValueParams for details.
Returns: Returns true if the call has been handled, or false otherwise.