Dynamo.Core.Threading.AsyncTaskExtensions
Tools for working productively with AsyncTask's

Dynamo.Core.Threading.AsyncTaskExtensions.Then(Dynamo.Core.Threading.AsyncTask,Dynamo.Core.Threading.AsyncTaskCompletedHandler)
Upon completion of the task, invoke the specified action
Returns: An IDisposable representing the event subscription

Dynamo.Core.Threading.AsyncTaskExtensions.ThenPost(Dynamo.Core.Threading.AsyncTask,Dynamo.Core.Threading.AsyncTaskCompletedHandler,System.Threading.SynchronizationContext)
Upon completion of the task, invoke the action asynchronously in the specified
SynchronizationContext
Returns: An IDisposable representing the event subscription

Dynamo.Core.Threading.AsyncTaskExtensions.ThenSend(Dynamo.Core.Threading.AsyncTask,Dynamo.Core.Threading.AsyncTaskCompletedHandler,System.Threading.SynchronizationContext)
Upon completion of the task, invoke the action synchronously in the specified
SynchronizationContext
Returns: An IDisposable representing the event subscription

Dynamo.Core.Threading.AsyncTaskExtensions.AllComplete(System.Collections.Generic.IEnumerable{Dynamo.Core.Threading.AsyncTask},System.Action{System.Collections.Generic.IEnumerable{Dynamo.Core.Threading.AsyncTask}})
Await the completion of a collection of scheduled tasks.  The given action
will only be executed after all events are complete or discarded.  The tasks
must already be scheduled and not yet completed or this action will never be
executed.
Returns: An IDisposable representing all of the event subscription