Dynamo.Interfaces.ISchedulerThread.Initialize(Dynamo.Core.Threading.IScheduler)
DynamoScheduler calls this method to initialize and start this
instance of scheduler thread. This call marks the point from which
it is safe to call into DynamoScheduler.
owningScheduler: A reference to the DynamoScheduler
object which owns this instance of scheduler thread.

Dynamo.Interfaces.ISchedulerThread.Shutdown
DynamoScheduler calls this method to shutdown the scheduler thread.