Dynamo.Core.Threading.CompileCustomNodeAsyncTask
Schedule this task to compile a CustomNodeDefinition asynchronously.

Dynamo.Core.Threading.CompileCustomNodeAsyncTask.Initialize(Dynamo.Core.Threading.CompileCustomNodeParams)
Call this method to intialize a CompileCustomNodeAsyncTask with an
EngineController and an GraphSyncData that is required to compile the
associated custom node.
initParams: Input parameters required for custom node
graph updates.
Returns: Returns true if GraphSyncData is not empty and that the
CompileCustomNodeAsyncTask should be scheduled for execution. Returns
false otherwise.