Dynamo.Nodes.VariableInputNodeController.GetInputIndexFromModel
Fetches the index number to use for the next port.

Dynamo.Nodes.VariableInputNodeController.RemoveInputFromModel
Removes an input from this node. Called when the '-' button is clicked.

Dynamo.Nodes.VariableInputNodeController.AddInputToModel
Adds an input to this node. Called when the '+' button is clicked.

Dynamo.Nodes.VariableInputNodeController.SetNumInputs(System.Int32)
Set the number of inputs.
numInputs:

Dynamo.Nodes.VariableInputNodeController.SerializeInputCount(System.Xml.XmlElement,System.Int32)
Serializes the input count of a VariableInputNode to Xml.
nodeElement:
amount: