Dynamo.Models.PortModel.PortConnected
Event triggered when a port is connected.

Dynamo.Models.PortModel.PortDisconnected
Event triggered when a port is disconnected.

Dynamo.Models.PortModel.Center
Center is used by connected connectors to update their shape
The "center" of a port is derived from the type of port and
offsets from the node origin based on the port's index in the
ports collection.

Dynamo.Models.PortModel.UsingDefaultValue
Controls whether this port is set to use it's default value (true) or yield a closure (false).

Dynamo.Models.PortModel.DefaultValueEnabled
Controls whether the Use Default Value option is available.

Dynamo.Models.PortModel.MarginThickness
Controls the space between successive output ports

Dynamo.Models.PortModel.DestroyConnectors
Deletes all connectors attached to this PortModel.

Dynamo.Models.PortModel.OnPortConnected(Dynamo.Models.ConnectorModel)
Called when a port is connected.
connector:

Dynamo.Models.PortModel.OnPortDisconnected
Called when a port is disconnected.
e: