Dynamo.Models.ScopedNodeModel
ScopedNodeModel will put its children in its scope so that they won't
get compiled in global scope.

Dynamo.Models.ScopedNodeModel.IsNodeInScope(Dynamo.Models.NodeModel,System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
If all nodes that the node outputs to are in scopes list. I.e.,
node:
scopes:
Returns:

Dynamo.Models.ScopedNodeModel.IsScopedInport(System.Int32)
Specify if the corresponding inport has scope or not.
portIndex:
Returns:

Dynamo.Models.ScopedNodeModel.GetInScopeNodesForInport(System.Int32,System.Boolean,System.Boolean,System.Boolean)
Get all nodes that in its input ports's scope. A node is in its
scope if that node is one of its upstream nodes.
portIndex: Inport index
checkEscape:
If need to exclude nodes that one of their downstream nodes are not
in the scope
isInclusive:
If a upstream node is ScopedNodeModel, need to include all upstream
nodes of that node.
Returns:

Dynamo.Models.ScopedNodeModel.GetInScopeNodes(System.Boolean,System.Boolean)
Return all nodes that are in the scope of this node.
nodes are not in the scope.
checkEscape:
Specifies if need to exclude nodes that one of their downstream
nodes are not in the scope
isInclusive:
If one of its upstream node is ScopedNodeModel, if need to include
all upstream nodes of that node.
Returns:

Dynamo.Models.ScopedNodeModel.GetNodesInTopScope(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
Iterate over nodes and remove all nodes that are in the scope of
some scoped node. So all returned nodes are in global scope.
nodes:
Returns:

Dynamo.Models.ScopedNodeModel.BuildOutputAstInScope(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode},System.Boolean,Dynamo.Engine.CodeGeneration.AstBuilder)
Similar to NodeModel.BuildOutputAst(). When compiled to AST, for
ScopedNodeModel this method will be called when all requirements are
satisfied. The derived class needs to implement this method to
compile its children into some scopes.
inputAstNodes:
verboseLogging:
builder:
Returns:

Dynamo.Models.ScopedNodeModel.BuildAstInScope(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode},System.Boolean,Dynamo.Engine.CodeGeneration.AstBuilder)
Similar to NodeModel.BuildAst(). When compiled to AST, for
ScopedNodeModel this method will be called when all requirements
are satisfied.
inputAstNodes:
verboseLogging:
builder:
Returns: