Dynamo.Engine.NodeToCode.NodeToCodeCompiler.GetCliques(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel})
For a selection, output partitions that each group of node can be
converted to code.
selection:
Returns:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.GetInputOutputMap(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Collections.Generic.Dictionary{System.String,System.String}@,System.Collections.Generic.Dictionary{System.String,System.String}@,System.Collections.Generic.Dictionary{System.String,System.String}@,System.Collections.Generic.Dictionary{System.String,ProtoCore.Type}@)
Collect input, output and renaming maps.
Inputs are input variables from external node models, finally
shorter names will be given for these inputs. Note when the
function returns, values in inputMap are always empty strings.
Outputs are variables that output to external node models.
Shorter names will be given for these outupts. But if outputs are
from code block node, as variables may be re-named during variable
numbering, we can't simply record orignal output variable names. So
when function returns, if a variable is from output port of non
code block node, there is an entry:
outputMap[var_node_model_guid] = ""
If a variable, say "foo", is from code block node, there are two
entries:
outputMap[foo_node_model_guid] = "foo"
outputMap[foo%node_model_guid] = foo_node_model_guid
We need second entry because because finally we will use outputMap
to restore the connection, and if "foo" is renamed to something
else, say "foo21", we can find the value of key from the second
entry and update the first entry to:
outputMap[foo_ndoe_mode_guid] = "foo21".
Renaming map are similar to output map. The difference is these
variables used internally and they may be renamed as well. In
some sense, it is just subset of outputMap.
nodes:
inputMap:
outputMap:
renamingMap:
typeHintMap:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.VariableNumbering(ProtoCore.Core,ProtoCore.AST.AssociativeAST.AssociativeNode,Dynamo.Models.NodeModel,System.Collections.Generic.Dictionary{System.String,Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.HashSet{System.String})
Renumber variables used in astNode.
astNode:
numberingMap:
variableMap:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NodeToCode(ProtoCore.Core,System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},Dynamo.Engine.NodeToCode.INamingProvider)
Compile a set of nodes to ASTs.
Note:
1. Nodes should be a clique with regarding to convertibility and
selection state. That is, these nodes can be safely to be
converted into a single code block node. It shouldn't have
unconvertible or unselected node on any path (if there is) that
connects any two of these nodes, otherwise there will be
circular references between unconvertible/unselected node and
code block node.
To split arbitary node set into cliques, use
NodeToCodeUtils.GetCliques().
2. WorkspaceNodes are all nodes in current workspace. We need the
whole graph so that each to-be-converted node will have correct
order in the final code block node.
core: Library core
workspaceNodes: The whole workspace nodes
nodes: Selected node that can be converted to a single code block node
namingProvider:
Returns: