Dynamo.Models.ConnectorModel.Make(Dynamo.Models.NodeModel,Dynamo.Models.NodeModel,System.Int32,System.Int32,System.Nullable{System.Guid})
Factory method to create a connector.  Checks to make sure that the start and end ports are valid,
otherwise returns null.
start: The port where the connector starts
end: The port where the connector ends
startIndex:
endIndex:
guid:
Returns: The valid connector model or null if the connector is invalid

Dynamo.Models.ConnectorModel.Delete(System.Boolean)
Delete the connector.
silent: If silent is true, the start and end ports will be disconnected
without raising port disconnection events.