Dynamo.Core.Threading.AsyncTask.TaskMergeInstruction
Merge instruction obtained from a call to AsyncTask.CanMergeWith.

Dynamo.Core.Threading.AsyncTask.TaskMergeInstruction.KeepBoth
Both the AsyncTask objects in comparison should be kept.

Dynamo.Core.Threading.AsyncTask.TaskMergeInstruction.KeepThis
The current instance of AsyncTask should be kept
while discarding the other AsyncTask in comparison.

Dynamo.Core.Threading.AsyncTask.TaskMergeInstruction.KeepOther
The current instance of AsyncTask should be discarded
while keeping the other AsyncTask in comparison.