Dynamo.Nodes.DSFunctionBase
Base class for NodeModels representing zero-touch-imported-function calls.

Dynamo.Nodes.DSFunctionBase.SerializeCore(System.Xml.XmlElement,Dynamo.Models.SaveContext)
Copy command will call it to serialize this node to xml data.