Dynamo.Models.NodeModel.cachedValue
The cached value of this node. The cachedValue object is protected by the cachedValueMutex
as it may be accessed from multiple threads concurrently.
However, generally access to the cachedValue property should be protected by usage
of the Scheduler.

Dynamo.Models.NodeModel.CreationName
The unique name that was created the node by

Dynamo.Models.NodeModel.DispatchOnUIThread(System.Action)
Called by nodes for behavior that they want to dispatch on the UI thread
Triggers event to be received by the UI. If no UI exists, behavior will not be executed.
a:

Dynamo.Models.NodeModel.InPortData
Definitions for the Input Ports of this NodeModel.

Dynamo.Models.NodeModel.OutPortData
Definitions for the Output Ports of this NodeModel.

Dynamo.Models.NodeModel.AllConnectors
All of the connectors entering and exiting the NodeModel.

Dynamo.Models.NodeModel.IsCustomFunction
Returns whether this node represents a built-in or custom function.

Dynamo.Models.NodeModel.IsVisible
Returns whether the node is to be included in visualizations.

Dynamo.Models.NodeModel.IsUpstreamVisible
Returns whether the node aggregates its upstream connections
for visualizations.

Dynamo.Models.NodeModel.IsInputNode
Input nodes are used in Customizer and Presets. Input nodes can be numbers, number sliders,
strings, bool, code blocks and custom nodes, which don't specify path.

Dynamo.Models.NodeModel.IsSelectedInput
Specifies whether an input node should be included in a preset.
By default, this field is set to true.

Dynamo.Models.NodeModel.State
The Node's state, which determines the coloring of the Node in the canvas.

Dynamo.Models.NodeModel.IsInErrorState
If the state of node is Error or AstBuildBroken

Dynamo.Models.NodeModel.ToolTipText
Text that is displayed as this Node's tooltip.

Dynamo.Models.NodeModel.OverrideNameWithNickName
Should we override the displayed name with this Node's NickName property?

Dynamo.Models.NodeModel.NickName
The name that is displayed in the UI for this NodeModel.

Dynamo.Models.NodeModel.InPorts
Collection of PortModels representing all Input ports.

Dynamo.Models.NodeModel.OutPorts
Collection of PortModels representing all Output ports.

Dynamo.Models.NodeModel.ArgumentLacing
Control how arguments lists of various sizes are laced.

Dynamo.Models.NodeModel.Name
Name property
If the node has a name attribute, return it.  Otherwise return empty string.

Dynamo.Models.NodeModel.Category
Category property
If the node has a category, return it.  Other wise return empty string.

Dynamo.Models.NodeModel.CachedValue
The value of this node after the most recent computation
As this property could be modified by the virtual machine, it's dangerous
to access this value without using the active Scheduler. Use the Scheduler to
remove the possibility of race conditions.

Dynamo.Models.NodeModel.GetCachedValueFromEngine(Dynamo.Engine.EngineController)
WARNING: This method is meant for unit test only. It directly accesses
the EngineController for the mirror data without waiting for any
possible execution to complete (which, in single-threaded nature of
unit test, is an okay thing to do). The right way to get the cached
value for a NodeModel is by going through its RequestValueUpdateAsync
method).
engine: Instance of EngineController from which the node
value is to be retrieved.
Returns: Returns the MirrorData if the node's value is computed, or
null otherwise.

Dynamo.Models.NodeModel.WasInvolvedInExecution
Use to indicated if a node was involved in the most recent graph evaluation.

Dynamo.Models.NodeModel.Tags
Search tags for this Node.

Dynamo.Models.NodeModel.Description
Description of this Node.

Dynamo.Models.NodeModel.AstIdentifierForPreview
ProtoAST Identifier for result of the node before any output unpacking has taken place.
If there is only one output for the node, this is equivalent to GetAstIdentifierForOutputIndex(0).

Dynamo.Models.NodeModel.IsConvertible
If this node is allowed to be converted to AST node in nodes to code conversion.

Dynamo.Models.NodeModel.AstIdentifierBase
Return a variable whose value will be displayed in preview window.
Derived nodes may overwrite this function to display default value
of this node. E.g., code block node may want to display the value
of the left hand side variable of last statement.

Dynamo.Models.NodeModel.DisplayLabels
Enable or disable label display. Default is false.

Dynamo.Models.NodeModel.IsPartiallyApplied
Is this node being applied partially, resulting in a partial function?

Dynamo.Models.NodeModel.GetDescriptionStringFromAttributes
Get the description from type information
Returns: The value or "No description provided"

Dynamo.Models.NodeModel.GetAstIdentifierForOutputIndex(System.Int32)
Fetches the ProtoAST Identifier for a given output port.
outputIndex: Index of the output port.
Returns: Identifier corresponding to the given output port.

Dynamo.Models.NodeModel.GetTypeHintForOutput(System.Int32)
The possible type of output at specified port. This
type information is not necessary to be accurate.
Returns:

Dynamo.Models.NodeModel.GetValue(System.Int32,Dynamo.Engine.EngineController)
Gets the most recent value of this node stored in an EngineController that has evaluated it.
outPortIndex:
engine:
Returns:

Dynamo.Models.NodeModel.SetNickNameFromAttribute
Sets the nickname of this node from the attributes on the class definining it.

Dynamo.Models.NodeModel.RaisesModificationEvents
Indicate if the node should respond to NodeModified event. It
always should be true, unless is temporarily set to false to
avoid flood of Modified event.

Dynamo.Models.NodeModel.Modified
Event fired when the node's DesignScript AST should be recompiled

Dynamo.Models.NodeModel.RequestSilenceNodeModifiedEvents
Called when a node is requesting that the workspace's node modified events be
silenced. This is particularly critical for code block nodes, whose modification can
mutate the workspace.
As opposed to RaisesModificationEvents, this modifies the entire parent workspace

Dynamo.Models.NodeModel.BuildOutputAst(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Override this to declare the outputs for each of this Node's output ports.
inputAstNodes: Ast for inputs indexed by input port index.
Returns: Sequence of AssociativeNodes representing this Node's code output.

Dynamo.Models.NodeModel.BuildAst(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode},Dynamo.Engine.CodeGeneration.CompilationContext)
Wraps the publically overrideable `BuildOutputAst` method so that it works with Preview.
inputAstNodes:
context: Compilation context

Dynamo.Models.NodeModel.OnBuilt
Callback for when this NodeModel has been compiled.

Dynamo.Models.NodeModel.AppendReplicationGuides(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Apppend replication guide to the input parameter based on lacing
strategy.
inputs:
Returns:

Dynamo.Models.NodeModel.ConnectorAdded
Event fired when a new ConnectorModel has been attached to one of this node's inputs.

Dynamo.Models.NodeModel.IsTopMostNode
If node is connected to some other node(other than Output) then it is not a 'top' node

Dynamo.Models.NodeModel.TryGetInput(System.Int32,System.Tuple{System.Int32,Dynamo.Models.NodeModel}@)
Attempts to get the input for a certain port.
data: PortData to look for an input for.
input: If an input is found, it will be assigned.
Returns: True if there is an input, false otherwise.

Dynamo.Models.NodeModel.TryGetOutput(System.Int32,System.Collections.Generic.HashSet{System.Tuple{System.Int32,Dynamo.Models.NodeModel}}@)
Attempts to get the output for a certain port.
output: Index to look for an output for.
newOutputs: If an output is found, it will be assigned.
Returns: True if there is an output, false otherwise.

Dynamo.Models.NodeModel.HasInput(System.Int32)
Checks if there is an input for a certain port.
data: Index of the port to look for an input for.
Returns: True if there is an input, false otherwise.

Dynamo.Models.NodeModel.HasConnectedInput(System.Int32)
Checks if there is a connected input for a certain port. This does
not count default values as an input.
data: Index of the port to look for an input for.
Returns: True if there is an input, false otherwise.

Dynamo.Models.NodeModel.HasOutput(System.Int32)
Checks if there is an output for a certain port.
portData: Index of the port to look for an output for.
Returns: True if there is an output, false otherwise.

Dynamo.Models.NodeModel.ClearRuntimeError
Clears the errors/warnings that are generated when running the graph.
If the node has a value supplied for the persistentWarning, then the
node's State will be set to ElementState.Persistent and the ToolTipText will
be set to the persistent warning. Otherwise, the State will be
set to ElementState.Dead

Dynamo.Models.NodeModel.Warning(System.String,System.Boolean)
Set a warning on a node.
p: The warning text.
isPersistent: Is the warning persistent? If true, the warning will not be
cleared when the node is next evaluated and any additional warning messages will be concatenated
to the persistent error message. If false, the warning will be cleared on the next evaluation.

Dynamo.Models.NodeModel.NotifyAstBuildBroken(System.String)
Change the state of node to ElementState.AstBuildBroken and display
"p" in tooltip window.
p:

Dynamo.Models.NodeModel.GetPortVerticalOffset(Dynamo.Models.PortModel)
If a "PortModel.LineIndex" property isn't "-1", then it is a PortModel
meant to match up with a line in code block node. A code block node may
contain empty lines in it, resulting in one PortModel being spaced out
from another one. In such cases, the vertical position of PortModel is
dependent of its "LineIndex".
If a "PortModel.LineIndex" property is "-1", then it is a regular
PortModel. Regular PortModel stacks up on one another with equal spacing,
so their positions are based solely on "PortModel.Index".
portModel: The portModel whose vertical offset is to be computed.
Returns: Returns the offset of the given port from the top of the ports

Dynamo.Models.NodeModel.RegisterInputPorts
Reads inputs list and adds ports for each input.

Dynamo.Models.NodeModel.RegisterOutputPorts
Reads outputs list and adds ports for each output

Dynamo.Models.NodeModel.ConfigureSnapEdges(System.Collections.Generic.IList{Dynamo.Models.PortModel})
Configures the snap edges.
ports: The ports.

Dynamo.Models.NodeModel.RegisterAllPorts
Updates UI so that all ports reflect current state of InPortData and OutPortData.

Dynamo.Models.NodeModel.AddPort(Dynamo.Models.PortType,Dynamo.Models.PortData,System.Int32)
Add a port to this node. If the port already exists, return that port.
portType:
data:
index:
Returns:

Dynamo.Models.NodeModel.PrintExpression
Creates a Scheme representation of this dynNode and all connected dynNodes.
Returns: S-Expression

Dynamo.Models.NodeModel.OnSave
Called when the node's Workspace has been saved.

Dynamo.Models.NodeModel.RequestValueUpdateAsync(Dynamo.Core.Threading.IScheduler,Dynamo.Engine.EngineController)
Call this method to asynchronously update the cached MirrorData for
this NodeModel through DynamoScheduler. AstIdentifierForPreview is
being accessed within this method, therefore the method is typically
called from the main/UI thread.

Dynamo.Models.NodeModel.RequestVisualUpdateAsync(Dynamo.Core.Threading.IScheduler,Dynamo.Engine.EngineController,Dynamo.Interfaces.IRenderPackageFactory,System.Boolean)
Call this method to asynchronously regenerate render package for
this node. This method accesses core properties of a NodeModel and
therefore is typically called on the main/UI thread.
scheduler: An IScheduler on which the task will be scheduled.
engine: The EngineController which will be used to get MirrorData for the node.
factory: An IRenderPackageFactory which will be used to generate IRenderPackage objects.
forceUpdate: Normally, render packages are only generated when the node's IsUpdated parameter is true.
By setting forceUpdate to true, the render packages will be updated.

Dynamo.Models.NodeModel.OnRenderPackageUpdateCompleted(Dynamo.Core.Threading.AsyncTask)
This event handler is invoked when UpdateRenderPackageAsyncTask is
completed, at which point the render packages (specific to this node)
become available.
asyncTask: The instance of UpdateRenderPackageAsyncTask
that was responsible of generating the render packages.

Dynamo.Models.NodeModel.RequestRenderPackages


Dynamo.Models.NodeModel.OnRequestRenderPackages
This event handler is invoked when the render packages (specific to this node)
become available and in addition the node requests for associated render packages
if any for example, packages used for associated node manipulators

Dynamo.Models.NodeModel.GetDrawableIds
Gets list of drawable Ids as registered with visualization manager
for all the output port of the given node.
Returns: List of Drawable Ids

Dynamo.Models.NodeModel.GetDrawableId(System.Int32)
Gets the drawable Id as registered with visualization manager for
the given output port on the given node.
outPortIndex: Output port index
Returns: Drawable Id