Dynamo.Models.HomeWorkspaceModel.IsTestMode
Flag specifying if this workspace is operating in "test mode".

Dynamo.Models.HomeWorkspaceModel.HasRunWithoutCrash
Indicates whether a run has completed successfully.
This flag is critical to ensuring that crashing run-auto files
are not left in run-auto upon reopening.

Dynamo.Models.HomeWorkspaceModel.silenceNodeModifications
Before the Workspace has been built the first time, we do not respond to
NodeModification events.

Dynamo.Models.HomeWorkspaceModel.EvaluationCount
Evaluation count is incremented whenever the graph is evaluated.
It is set to zero when the graph is Cleared.

Dynamo.Models.HomeWorkspaceModel.PreloadedTraceData
In near future, the file loading mechanism will be completely moved
into WorkspaceModel, that's the time we removed this property setter below.

Dynamo.Models.HomeWorkspaceModel.RequestRun
Invoked when a change to the workspace that requires re-execution
has taken place.  If in run-automatic, a new run will take place,
otherwise nothing will happen.

Dynamo.Models.HomeWorkspaceModel.NodeModified(Dynamo.Models.NodeModel)
Called when a Node is modified in the workspace
node: The node itself

Dynamo.Models.HomeWorkspaceModel.RegisterNode(Dynamo.Models.NodeModel)
Called when a node is added to the workspace and event handlers are to be added
node: The node itself

Dynamo.Models.HomeWorkspaceModel.DisposeNode(Dynamo.Models.NodeModel)
Called when a node is disposed and removed from the workspace
node: The node itself

Dynamo.Models.HomeWorkspaceModel.NodeOnRequestSilenceNodeModifiedEvents(Dynamo.Models.NodeModel,System.Boolean)
Called when the RequestSilenceNodeModifiedEvents event is emitted from a Node
node: The node itself
value: A boolean value indicating whether to silence or not

Dynamo.Models.HomeWorkspaceModel.Clear
Clears this workspace of nodes, notes, and connectors.

Dynamo.Models.HomeWorkspaceModel.StartPeriodicEvaluation
Start periodic evaluation using the currently set RunPeriod

Dynamo.Models.HomeWorkspaceModel.StopPeriodicEvaluation
Stop the on-going periodic evaluation, if there is any.

Dynamo.Models.HomeWorkspaceModel.ResetEngine(Dynamo.Engine.EngineController,System.Boolean)
Call this method to reset the virtual machine, avoiding a race
condition by using a thread join inside the vm executive.
TODO(Luke): Push this into a resync call with the engine controller
controller:
markNodesAsDirty: Set this parameter to true to force
reset of the execution substrait. Note that setting this parameter
to true will have a negative performance impact.

Dynamo.Models.HomeWorkspaceModel.MarkNodesAsModifiedAndRequestRun(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Boolean)
Mark the input nodes as modified
nodes: The nodes to modify
forceExecute: The argument to NodeModel.MarkNodeAsModified

Dynamo.Models.HomeWorkspaceModel.OnUpdateGraphCompleted(Dynamo.Core.Threading.AsyncTask)
This callback method is invoked in the context of ISchedulerThread
when UpdateGraphAsyncTask is completed.
task: The original UpdateGraphAsyncTask instance.

Dynamo.Models.HomeWorkspaceModel.Run
This method is typically called from the main application thread (as
a result of user actions such as button click or node UI changes) to
schedule an update of the graph. This call may or may not represent
an actual update. In the event that the user action does not result
in actual graph update (e.g. moving of node on UI), the update task
will not be scheduled for execution.

Dynamo.Models.HomeWorkspaceModel.GetExecutingNodes(System.Boolean)
This function gets the set of nodes that will get executed in the next run.
This function will be called when the nodes are modified or when showrunpreview is set
the executing nodes will be sent via SetNodeDeltaState event.
showRunPreview: This parameter controls the delta state computation

Dynamo.Models.HomeWorkspaceModel.GetOrphanedSerializablesAndClearHistoricalTraceData
Returns a list of ISerializable items which exist in the preloaded
trace data but do not exist in the current CallSite data.
Returns: