net.riversofdata.dhlogger.Log.dbMutex
This mutex guards transactions on the memory store

net.riversofdata.dhlogger.Log.AppName
The name of the application associated with the log entries

net.riversofdata.dhlogger.Log.UserID
A Guid string for the user associated with the log entries

net.riversofdata.dhlogger.Log.SessionID
A Guid string for the session that the user is engaging with

net.riversofdata.dhlogger.Log.uploadedItemsMutex
An object used to guard the uploadedItemsCount

net.riversofdata.dhlogger.Log.UploadedItems
The number of items that this log entity has successfully uploaded
This may be greater than the number of calls due to splitting of large entries

net.riversofdata.dhlogger.Log.#ctor(System.String,System.String,System.String)
Create a new log instance
appName: The name of the application associated with this log
userID: A statistically unique string associated with the user, e.g. a GUID
sessionID: A statistically unique string associated with the session, e.g. a GUID

net.riversofdata.dhlogger.Log.Debug(System.String,System.String)
Log an item at debug priority
tag: Tag associated with the log item
text: Text to log

net.riversofdata.dhlogger.Log.Error(System.String,System.String)
Log an item at error priority
tag: Tag associated with the log item
text: Text to log

net.riversofdata.dhlogger.Log.Info(System.String,System.String)
Log an item at info priority
tag: Tag associated with the log item
text: Text to log

net.riversofdata.dhlogger.Log.Verbose(System.String,System.String)
Log an item at verbose priority
tag: Tag associated with the log item
text: Text to log

net.riversofdata.dhlogger.Log.PrepAndPushItem(System.String,System.String,System.String)
Methods that preps a write request
This method calls recursively up to once if the text is too large and needs
splitting
tag:
priority:
text:

net.riversofdata.dhlogger.Log.UploaderExec
Core thread method for handling the upload

net.riversofdata.dhlogger.Log.UploadItem(System.Collections.Generic.Dictionary{System.String,System.String})
Code to transfer an item iver the network
item:
Returns: true if success, false otherwise

net.riversofdata.dhlogger.Log.SplitText(System.String)
Split a string into shorter strings as defined by the const
params
text:
Returns:

net.riversofdata.dhlogger.Log.ValidateInput(System.String,System.String)
Do input validation tests
tag:
text:

net.riversofdata.dhlogger.Log.ValidateTextContent(System.String)
Ensure that the text that is being sent is only alphanumeric
and hypen
str:
Returns:

net.riversofdata.dhlogger.Log.ValidateLength(System.String)
Ensure that the names and tags fit within the safe window after
we've put a GUID and a serial on the end of them
str:
Returns: