Dynamo.Nodes.BuiltinNodeCategories
Built-in Dynamo Categories. If you want your node to appear in one of the existing Dynamo
categories, then use these constants. This ensures that if the names of the categories
change down the road, your node will still be placed there.