Dynamo.Services.Heartbeat
Class to automatically report various metrics of the application usage

Dynamo.Services.Heartbeat.PackFrequencyDict(System.Collections.Generic.Dictionary{System.String,System.Int32})
Turn a frequency dictionary into a string that can be sent
frequencies:
Returns: