Dynamo.Engine.EngineController.GenerateGraphSyncData(System.Collections.Generic.ICollection{Dynamo.Models.NodeModel},System.Boolean)
Generate graph sync data based on the input Dynamo nodes. Return
false if all nodes are clean.
nodes:
verboseLogging:
Returns:

Dynamo.Engine.EngineController.ComputeSyncData(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Boolean)
This method is called on the main thread from UpdateGraphAsyncTask
to generate GraphSyncData for a list of updated nodes.
nodes:
updatedNodes: The list of all updated nodes.
verboseLogging:
Returns: This method returns true if GraphSyncData is generated from
the list of updated nodes. If updatedNodes is empty or does not
result in any GraphSyncData, then this method returns false.

Dynamo.Engine.EngineController.PreviewGraphSyncData(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Boolean)
This is called on the main thread from PreviewGraphSyncData
to generate the list of node id's that will be executed on the next run
updatedNodes: The updated nodes.
Returns: This method returns the list of all reachable node id's from the given
updated nodes

Dynamo.Engine.EngineController.GenerateGraphSyncDataForCustomNode(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},Dynamo.CustomNodeDefinition,System.Boolean)
Generate graph sync data based on the input Dynamo custom node information.
Return false if all nodes are clean.
nodes:
definition:
verboseLogging:
Returns:

Dynamo.Engine.EngineController.ProcessPendingCustomNodeSyncData(Dynamo.Core.Threading.IScheduler)
DynamoModel calls this method prior to scheduling a graph update for
the home workspace. This method is called to schedule custom node
compilation since the home workspace update may depend on it. Any
updates to a CustomNodeDefinition will cause GraphSyncData to be added
to "pendingCustomNodeSyncData" queue.
scheduler: The scheduler on which custom node compilation
task can be scheduled.

Dynamo.Engine.EngineController.UpdateGraph(System.Collections.Generic.ICollection{Dynamo.Models.NodeModel},System.Exception@)
Update graph with graph sync data.
nodes:
fatalException: The exception that is not handled
anywhere within the LiveRunnerServices.UpdateGraph method. This
parameter will always be set to null if there is no unhandled
exception thrown from within the UpdateGraph call.
Returns: Returns true if any update has taken place, or false
otherwise.

Dynamo.Engine.EngineController.NodeDeleted(Dynamo.Models.NodeModel)
NodeDeleted event handler.
node: