Dynamo.Services.ShapewaysClient
Class provides the interaction between Dynamo client and Shapeways API

Dynamo.Services.ShapewaysClient.LoginUrl
LoginUrl property
Contains URL to Shapeways login UI

Dynamo.Services.ShapewaysClient.Secret
Secret property
Contains oauth_secret param

Dynamo.Services.ShapewaysClient.Token
Token property
Contains oauth_token param

Dynamo.Services.ShapewaysClient.Verifier
Verifier property
Contains oauth_verifier param

Dynamo.Services.ShapewaysClient.RequestToken
Get Oauth request token to authorized with Shapeways service

Dynamo.Services.ShapewaysClient.UploadModel(System.String,System.String)
Upload an STL model to Shapeways service using obtained credantials
rawData: Raw STL geometry data
filename: Gives a name to your uploaded file