Dynamo.Nodes.DSVarArgFunction
DesignScript var-arg function node. All functions from DesignScript share the
same function node but internally have different procedure.

Dynamo.Nodes.DSVarArgFunction.VarInputController
Custom VariableInput controller for DSVarArgFunctions.