Dynamo.Core.Threading.SetTraceDataAsyncTask.Initialize(Dynamo.Engine.EngineController,Dynamo.Models.HomeWorkspaceModel)
This method is called by task creator to associate the trace data with
the current instance of virtual machine. The given WorkspaceModel can
optionally contain saved trace data in a previous execution session. As
a side-effect, this method resets "WorkspaceModel.PreloadedTraceData"
data member to ensure the correctness of the execution flow.
controller: Reference to the EngineController on which the
loaded trace data should be set.
workspace: The workspace from which the trace data should
be retrieved.
Returns: If the given WorkspaceModel contains saved trace data, this
method returns true, in which case the task needs to be scheduled.
Otherwise, the method returns false.