Dynamo.Models.NodeFactory
Manages factories and loaders for NodeModels. Can use registered factories
and loaders to instantiate and load new NodeModels.

Dynamo.Models.NodeFactory.AddLoader``1(Dynamo.Models.INodeLoader{``0})
Adds a node loader to this manager.
loader:

Dynamo.Models.NodeFactory.AddLoader``1(System.Type,Dynamo.Models.INodeLoader{``0})
Adds a node loader to this manager, for the given type.
nodeType:
loader:

Dynamo.Models.NodeFactory.AddFactory``1(Dynamo.Models.INodeFactory{``0})
Adds a node factory to this manager.
loader:

Dynamo.Models.NodeFactory.AddFactory``1(System.Type,Dynamo.Models.INodeFactory{``0})
Adds a node factory to this manager, for a given type.
nodeType:
loader:

Dynamo.Models.NodeFactory.AddTypeFactoryAndLoader``1
Attempts to create a new factory and loader for a given type.

Dynamo.Models.NodeFactory.CreateProxyNodeInstance(System.Guid,System.String,System.String,System.Int32,System.Int32)
A proxy custom node is a custom node without its definition loaded
in Dynamo. The creation of a proxy custom node relies on information
provided by the caller since the definition is not readily available
for reading. The actual definition may become available at a later
time by means of user uploading the definition.
id: Identifier of the custom node instance.
name: The name represents the GUID of the custom node
definition that is used for creating the custom node instance.
nickName: The display name of the custom node.
inputs: Number of input ports.
outputs: Number of output ports.
Returns: Returns the custom node instance if creation was successful,
or null otherwise.

Dynamo.Models.NodeFactory.AddTypeFactoryAndLoader(System.Type)
Attempts to create a new factory and loader for a given type.
nodeType:

Dynamo.Models.NodeFactory.AddAlsoKnownAs(System.Type,System.String,System.Boolean)
Registers a type with another name that it may go by.
realType:
aka:
overwrite:

Dynamo.Models.NodeFactory.AddAlsoKnownAs(System.Type,System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Registers a type with other names that it may go by.
realType:
names:
overwrite:

Dynamo.Models.NodeFactory.ResolveType(System.String,System.Type@)
Given a type name, attempts to get the type associated with that name.
fullyQualifiedName:
type:
Returns:

Dynamo.Models.NodeFactory.CreateNodeFromXml(System.Xml.XmlElement,Dynamo.Models.SaveContext,ProtoCore.Namespace.ElementResolver)
Creates and Loads a new NodeModel from its Serialized form, using the node loaders
registered in this factory. If loading fails, a Dummy Node is produced.
elNode:
context:
Returns:

Dynamo.Models.NodeFactory.CreateNodeFromTypeName(System.String,Dynamo.Models.NodeModel@)
Creates a new NodeModel from its typeName, using the node factories registered
in this factory.
typeName:
node:
Returns: