Dynamo.Nodes.ZeroTouchNodeController`1
Controller that synchronizes a node with a zero-touch function definition.

Dynamo.Nodes.ZeroTouchNodeController`1.Description
Description of function, taken from Definition.

Dynamo.Nodes.ZeroTouchNodeController`1.Category
Category of function, taken from Definition.

Dynamo.Nodes.ZeroTouchNodeController`1.MangledName
MangledName of function, taken from Definition.

Dynamo.Nodes.ZeroTouchNodeController`1.IsInstanceMember
Is this function an instance member of a class?

Dynamo.Nodes.ZeroTouchNodeController`1.IsStaticMember
Is this function a static member of a class?

Dynamo.Nodes.ZeroTouchNodeController`1.IsConstructor
Is this function a constructor of a class?

Dynamo.Nodes.ZeroTouchNodeController`1.InitializeFunctionParameters(Dynamo.Models.NodeModel,System.Collections.Generic.IEnumerable{Dynamo.Library.TypedParameter})
Initializes a node's InPortData based on a list of parameters.
model: Node to initialize.
parameters: Parameters used for initialization.

Dynamo.Nodes.ZeroTouchNodeController`1.CreateFunctionObject(Dynamo.Models.NodeModel,ProtoCore.AST.AssociativeAST.AssociativeNode,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Creates a FunctionObject representing a partial application of a function.
model: Node to produce FunctionObject for.
functionNode: AST representing the function to make a FunctionObject out of.
inputs: Arguments to be applied partially.