Dynamo.Search.Interfaces.ISearchEntry
Has a collection of strings that can be used to identifiy the instance
in a search.

Dynamo.Search.Interfaces.ISearchEntry.Name
Name of this search entry.

Dynamo.Search.Interfaces.ISearchEntry.SearchTags
Tags which can be used to search for this entry.

Dynamo.Search.Interfaces.ISearchEntry.SearchTagWeights
Every search tag should have weight. This weight will be taken into account during search.

Dynamo.Search.Interfaces.ISearchEntry.Description
Description of this search entry.