Dynamo.Nodes.CodeBlockUtils.NormalizeLineBreaks(System.String)
Call this method to turn all "\r\n" and "\r"
occurrences in the given string into "\n".
text: The text to be normalized
Returns: Returns the normalized string.

Dynamo.Nodes.CodeBlockUtils.GenerateInputPortData(System.Collections.Generic.IEnumerable{System.String})
Call this method to generate a list of PortData from given set of
unbound identifiers. This method ensures that the generated ports
are only having names that do not exceed a preconfigured length.
unboundIdents: A list of unbound identifiers for which
input port data is to be generated. This list can be empty but it
cannot be null.
Returns: Returns a list of input port data generated based on the
input unbound identifier list.

Dynamo.Nodes.CodeBlockUtils.GetStatementVariables(System.Collections.Generic.IEnumerable{Dynamo.Nodes.Statement},System.Boolean)
Call this method to get a list of lists of variables defined in
the given set of Statement objects. This method is typically used
in conjunction with DoesStatementRequireOutputPort method.
statements: A list of Statement objects whose defined
variables are to be retrieved. This list can be empty but it cannot
be null.
onlyTopLevel: Set this parameter to false to retrieve
all variables defined in nested Statement objects.
Returns: Returns a list of lists of variables defined by the given
set of Statement objects.

Dynamo.Nodes.CodeBlockUtils.DoesStatementRequireOutputPort(System.Collections.Generic.IEnumerable{System.Collections.Generic.IEnumerable{System.String}},System.Int32)
Checks wheter an outport is required for a Statement with the given
index. An outport is not required if there are no defined variables
or if any of the defined variables have been declared again later on
in the same code block.
statementVariables: A list of lists, each of which
contains variables defined by a Statement at the index. This list
can be obtained from calling GetStatementVariables method.
index: The index of the Statement for which this call
is made.
Returns: Returns true if an output port is required, or false
otherwise.

Dynamo.Nodes.CodeBlockUtils.FormatUserText(System.String)
Call this method to format user codes in the following ways:
1. Leading and trailing whitespaces are removed from the original
string. Characters that qualify as "whitespaces" are: '\n', '\t'
and ' '.
2. Multiple statements on a single line will be broken down further
into multiple statements. For example, "a = 1; b = 2;" will be
broken down into two lines: "a = 1;\nb = 2;" (line break denoted
by the new \n character).
3. Leading whitespaces will be removed ony for the first line. This
is to preserve the indentation for lines other than the first.
4. If the resulting codes do not end with a closing curly bracket '}',
then a semi-colon is appended to the code. This ensures codes like
"a" will result in codes becoming "a;"
inputCode: Original code content as typed in by the user.
Returns: Returns the formatted code with the above process.

Dynamo.Nodes.CodeBlockUtils.GetDefinitionLineIndexMap(System.Collections.Generic.IEnumerable{Dynamo.Nodes.Statement})
Returns a list of defined variables, along with the line number on which
they are defined last. A variable can be defined multiple times in a single
code block node, but the output port is only shown on the last definition.
Returns: Returns a map between defined variables and the line index on
which they are defined last.