Dynamo.Interfaces.ICustomNodeSource.CreateCustomNodeInstance(System.Guid,System.String,System.Boolean)
Creates a new Custom Node Instance.
id: Identifier referring to a custom node definition.
nickname:
isTestMode: