Dynamo.Nodes.CustomNodeController`1
Controller that synchronizes a node with a custom node definition.

Dynamo.Nodes.CustomNodeController`1.IsInSyncWithNode(Dynamo.Models.NodeModel)
Return if the custom node instance is in sync with its definition.
It may be out of sync if .dyf file is opened and updated and then
.dyn file is opened.