Dynamo.Core.Threading.UpdateRenderPackageAsyncTask
An asynchronous task to regenerate render packages for a given node.
During execution the task retrieves the corresponding IGraphicItem from
EngineController through a set of drawable identifiers supplied by the
node. These IGraphicItem objects then fill the IRenderPackage objects
with tessellated geometric data. Each of the resulting IRenderPackage
objects is then tagged with a label.