Dynamo.Nodes.FunctionCallBase`2
Node base class for all nodes that produce a DS function call.

Dynamo.Nodes.FunctionCallBase`2.Controller
Controller used to sync node with a function definition.

Dynamo.Nodes.FunctionCallBase`2.CreationName
The unique name that the node was created by