Dynamo.Search.Interfaces.ISearchCategory`1
A search category.

Dynamo.Search.Interfaces.ISearchCategory`1.Name
The name of this category.

Dynamo.Search.Interfaces.ISearchCategory`1.Entries
Entries contained in this category.

Dynamo.Search.Interfaces.ISearchCategory`1.SubCategories
Sub-categories contained in this category