Dynamo.Nodes.CodeBlockNodeModel.ProcessError
It removes all the in ports and out ports so that the user knows there is an error.

Dynamo.Nodes.CodeBlockNodeModel.GetDefinedVariableNames
Returns the names of all the variables defined in this code block.
Returns: List containing all the names

Dynamo.Nodes.CodeBlockNodeModel.GetInportIndex(Dynamo.Nodes.CodeBlockNodeModel,System.String)
Returns the index of the port corresponding to the variable name given
variableName:  Name of the variable corresponding to an input port
Returns:  Index of the required port in the InPorts collection

Dynamo.Nodes.CodeBlockNodeModel.GetOutportIndex(System.String)
Returns the corresponding output port index for a given defined variable
variableName:
Returns:

Dynamo.Nodes.CodeBlockNodeModel.TempVariables
Temporary variables that generated in code.

Dynamo.Nodes.CodeBlockNodeModel.GetAstIdentifierForOutputIndexInternal(System.Int32,System.Boolean)
For code block nodes, each output identifier of an output port is mapped.
For an example, "p = 1" would have its internal identifier renamed to
"pXXXX", where "XXXX" is the GUID of the code block node. This mapping is
done to ensure the uniqueness of the output variable name.
portIndex: Output port index
forRawName: Set this parameter to true to retrieve the
original identifier name "p". If this parameter is false, the mapped
identifer name "pXXXX" is returned instead.
Returns:

Dynamo.Nodes.CodeBlockNodeModel.GetTypeHintForOutput(System.Int32)
Return possible type of the output at specified output port.
index:
Returns:

Dynamo.Nodes.CodeBlockNodeModel.CreateInputOutputPorts
Creates the inport and outport data based on
the statements generated from the user code.

Dynamo.Nodes.CodeBlockNodeModel.SaveAndDeleteConnectors(System.Collections.IDictionary,System.Collections.IDictionary)
Deletes all the connections and saves their data (the start and end port)
so that they can be recreated if needed.
inportConnections: A list of connections that will be destroyed
outportConnections:

Dynamo.Nodes.CodeBlockNodeModel.LoadAndCreateConnectors(System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary)
Now that the portData has been set for the new ports, we recreate the connections we
so mercilessly destroyed, restoring peace and balance to the world once again.
inportConnections:
outportConnections:  List of the connections that were killed