Dynamo.PreferenceSettings
PreferenceSettings is a class for GUI to persist certain settings.
Upon running of the GUI, those settings that are persistent will be loaded
from a XML file from DYNAMO_SETTINGS_FILE.
When GUI is closed, the settings into the XML file.

Dynamo.PreferenceSettings.LibraryWidth
The width of the library pane.

Dynamo.PreferenceSettings.ConsoleHeight
The height of the console display.

Dynamo.PreferenceSettings.ShowConnector
Should connectors be visible?

Dynamo.PreferenceSettings.ConnectorType
The types of connector: Bezier or Polyline.

Dynamo.PreferenceSettings.IsBackgroundPreviewActive
Should the background 3D preview be shown?

Dynamo.PreferenceSettings.NumberFormat
The decimal precision used to display numbers.

Dynamo.PreferenceSettings.MaxNumRecentFiles
The maximum number of recent file paths to be saved.

Dynamo.PreferenceSettings.RecentFiles
A list of recently opened file paths.

Dynamo.PreferenceSettings.BackupFiles
A list of backup file paths.

Dynamo.PreferenceSettings.CustomPackageFolders
A list of folders containing zero-touch nodes and custom nodes.

Dynamo.PreferenceSettings.PackageDirectoriesToUninstall
A list of packages used by the Package Manager to determine
which packages are marked for deletion.

Dynamo.PreferenceSettings.WindowX
The last X coordinate of the Dynamo window.

Dynamo.PreferenceSettings.WindowY
The last Y coordinate of the Dynamo window.

Dynamo.PreferenceSettings.WindowW
The last width of the Dynamo window.

Dynamo.PreferenceSettings.WindowH
The last height of the Dynamo window.

Dynamo.PreferenceSettings.UseHardwareAcceleration
Should Dynamo use hardware acceleration if it is supported?

Dynamo.PreferenceSettings.BackupInterval
This defines how long (in milliseconds) will the graph be automatically saved.

Dynamo.PreferenceSettings.BackupFilesCount
This defines how many files will be backed up.

Dynamo.PreferenceSettings.PackageDownloadTouAccepted
Indicates if the user has accepted the terms of
use for downloading packages from package manager.

Dynamo.PreferenceSettings.ShowEdges
Indicates whether surface and solid edges will
be rendered.

Dynamo.PreferenceSettings.Save(System.String)
Save PreferenceSettings in XML File Path if possible,
else return false
filePath: Path of the XML File
Returns: Whether file is saved or error occurred.

Dynamo.PreferenceSettings.SaveInternal(System.String)
Save PreferenceSettings in a default directory when no path is
specified.
preferenceFilePath: The file path to save preference
settings to. If this parameter is null or empty string, preference
settings will be saved to the default path.
Returns: Whether file is saved or error occurred.

Dynamo.PreferenceSettings.Load(System.String)
Return PreferenceSettings from XML path if possible,
else return PreferenceSettings with default values
filePath: Path of the XML File
Returns:
Stored PreferenceSettings from xml file or
Default PreferenceSettings if xml file is not found.