Dynamo.Models.TypeLoadData.Assembly
Assembly containing the type.

Dynamo.Models.TypeLoadData.Type
The type this data is associated with.

Dynamo.Models.TypeLoadData.ObsoleteMessage
Information about why this type is obsolete, if it is actually obsolete.

Dynamo.Models.TypeLoadData.IsObsolete
Specifies whether or not this Type is obsolete.

Dynamo.Models.TypeLoadData.AlsoKnownAs
Other names this type might go by inside of Dynamo.

Dynamo.Models.TypeLoadData.IsDeprecated
Specifies whether or not this type is deprecated by Dynamo.

Dynamo.Models.TypeLoadData.IsMetaNode
Specifies whether or not this type is considered a "meta node"

Dynamo.Models.TypeLoadData.IsDSCompatible
Specifies whether or not this type is considered "DesignScript compatible"

Dynamo.Models.TypeLoadData.IsHidden
Specifies whether or not this type should be hidden from users in search.

Dynamo.Models.TypeLoadData.Name
The Name associated with this type.

Dynamo.Models.TypeLoadData.SearchKeys
Search keys that can be used to search for this type.

Dynamo.Models.TypeLoadData.Category
The category of this type, used in search.

Dynamo.Models.TypeLoadData.Description
The description of this type.

Dynamo.Models.TypeLoadData.IsPackageMember
Indicates if the type is loaded from a package.