Dynamo.Nodes.CodeCompletionParser
This class exposes utility methods to:
1. extract variable types from variable declarations such as 'Point' from a : Point;
2. extract the string to autocomplete on from a block of code

Dynamo.Nodes.CodeCompletionParser.strPrefix
Expression to autocomplete on is on top of 'expressionStack'

Dynamo.Nodes.CodeCompletionParser.functionName
Function call being currently typed

Dynamo.Nodes.CodeCompletionParser.functionPrefix
Identifier or Class name on which function being typed currently is invoked

Dynamo.Nodes.CodeCompletionParser.GetVariableType(System.String,System.String)
Parses given block of code and declared variable,
returns the type of the variable: e.g. in:
"a : Point;" returns 'Point'
code:  block of code being parsed
variableName: input declared variable: 'a' in example
Returns:  returns Point in example

Dynamo.Nodes.CodeCompletionParser.GetStringToComplete(System.String)
Given the code that's currently being typed in a CBN,
this function extracts the expression that needs to be code-completed
e.g. given "abc.X[{xyz.b.foo((abc" it returns "abc"
which is the "thing" that needs to be queried for completions
code:

Dynamo.Nodes.CodeCompletionParser.GetFunctionToComplete(System.String,System.String@,System.String@)
Given a block of code that's currently being typed
this returns the method name and the type name on which it is invoked
e.g. "Point.ByCoordinates" returns 'ByCoordinates' as the functionName and 'Point' as functionPrefix
"abc.X[{xyz.b.foo" returns 'foo' as the functionName and 'xyz.b' as the "functionPrefix" on which it is invoked
code:  input code block
functionName:  output function name
functionPrefix:  output type or variable on which fn is invoked

Dynamo.Nodes.CodeCompletionParser.IsInsideCommentOrString(System.String,System.Int32)
Parse text to determine if string being typed at caretPos is in
the context of a comment or string or character
text:  input block of code
caretPos:  caret position in text at which to determine context
Returns:  True if any of above context is true