Dynamo.Models.AnnotationModel.Rect
Overriding the Rect from Modelbase
This gets the actual RECT of the group.
This is required to make the group as ILocatable.

Dynamo.Models.AnnotationModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Models.NoteModel})
Initializes a new instance of the Dynamo.Models.AnnotationModel class.
nodes: The nodes.
notes: The notes.
loadFromGraph: This is true when graph is loaded from XML

Dynamo.Models.AnnotationModel.model_Disposed(Dynamo.Models.ModelBase)
Recalculate the group when a node is disposed
node: The node.

Dynamo.Models.AnnotationModel.UpdateBoundaryFromSelection
Updates the group boundary based on the nodes / notes selection.

Dynamo.Models.AnnotationModel.CalculateWidthAndHeight
Group the Models based on Height and Width
Returns:  the width and height of the last model

Dynamo.Models.AnnotationModel.AddToSelectedModels(Dynamo.Models.ModelBase,System.Boolean)
This is called when a model is deleted from a group
and UNDO is clicked.
model: The model.
checkOverlap:  checkoverlap determines whether the selected model is
completely inside that group

Dynamo.Models.AnnotationModel.Select
Overriding the Select behavior
because selecting the  group should select the models
within that group

Dynamo.Models.AnnotationModel.Deselect
Overriding the Deselect behavior
because deselecting the  group should deselect the models
within that group