Dynamo.Search.NodeSearchModel.ProcessNodeCategory(System.String,Dynamo.Search.SearchElementGroup@)
Call this method to assign a default grouping information if a given category
does not have any. A node category's group can either be "Create", "Query" or
"Actions". If none of the group names above is assigned to the category, it
will be assigned a default one that is "Actions".
For examples:
"Core.Evaluate" will be renamed as "Core.Evaluate.Actions"
"Core.List.Create" will remain as "Core.List.Create"