Dynamo.DynamoLogger.#ctor(Dynamo.Core.DebugSettings,System.String)
The default constructor.

Dynamo.DynamoLogger.Log(System.String,Dynamo.LogLevel,System.Boolean)
Log the message to the the correct path
message:

Dynamo.DynamoLogger.Log(System.String)
Log a message
message:

Dynamo.DynamoLogger.Log(System.Exception)
Log an exception
e:

Dynamo.DynamoLogger.Log(System.String,System.String)
Log some data with an associated tag
tag:
data:

Dynamo.DynamoLogger.StartLogging(System.String)
Begin logging.

Dynamo.DynamoLogger.Dispose(System.Boolean)
Dispose of the logger and finish logging.