Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Models.CustomNodeWorkspaceModel@)
Get the function workspace from a guid
id: The unique id for the node.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
ws:
Returns: The path to the node or null if it wasn't found.

Dynamo.Core.CustomNodeManager.OpenCustomNodeWorkspace(System.Xml.XmlDocument,Dynamo.Models.WorkspaceInfo,System.Boolean,Dynamo.Models.WorkspaceModel@)
Opens a Custom Node workspace from an XmlDocument, given a pre-constructed WorkspaceInfo.
xmlDoc: XmlDocument representing the parsed custom node file.
workspaceInfo: Workspace header describing the custom node file.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
workspace:
Returns:

Dynamo.Core.CustomNodeManager.InitializeCustomNode(System.Guid,System.Boolean,Dynamo.Models.CustomNodeWorkspaceModel@)
Deserialize a function definition from a given path.  A side effect of this function is that
the node is added to the dictionary of loadedNodes.
functionId: The function guid we're currently loading
isTestMode:
workspace: The resultant function definition
Returns:

Dynamo.Core.CustomNodeManager.Collapse(System.Collections.Generic.IEnumerable{Dynamo.Models.NodeModel},Dynamo.Models.WorkspaceModel,System.Boolean,Dynamo.Models.FunctionNamePromptEventArgs)
Collapse a set of nodes in a given workspace.
selectedNodes:  The function definition for the user-defined node
currentWorkspace:  The workspace where
isTestMode:
args: