Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.RecordCreation(Dynamo.Models.ModelBase)
Add a creation action.
model:

Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.RecordDeletion(Dynamo.Models.ModelBase)
Add a deletion action. If a creation action for the same model has
been added, that creation action will be removed and this deletion
action won't be added.
model: